lib/tasks/casino/create_games.rake

INSERT INTO "games" ("name", "kind", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Frutty-Tutty"], ["kind", 0], ["created_at", "2024-05-15 21:45:56.154533"], ["updated_at", "2024-05-15 21:45:56.154533"]]
SELECT "games".* FROM "games" WHERE "games"."name" = $1 AND "games"."kind" = $2 LIMIT $3  [["name", "Frutty-Tutty"], ["kind", 0], ["LIMIT", 1]]
---
  task create_games: :environment do
    Rails.logger.info("Creating games...")

    Rails.logger.debug("Frutt-Tutty game creation...")
    # TODO: Default credits should be store somewhere like config yml or .env
    Game.find_or_create_by!(name: "Frutty-Tutty", kind: "slots", credits: 10)